1. 사업자등록번호 1~9번째 자리를 각각 137137135를 대입하여 곱한 수의 합계를 구한다.

2. 9번째자리의 수에 5를 곱하고 10으로 나누어 몫을 구한다.

3. 1과 2의 합에 10을 나누어 나머지만 취한다.

4. 3의 수에 10을 빼 체크섬을 구하여 사업자등로번호 10번째자리와 동일한지 확인한다.

 

예] 사업자등록번호가 120-81-27641 이라면,

 

      1.       1    2    0    8    1    2    7    6    4    1

                *     *    *     *     *    *    *     *    *  

                1    3    7    1    3    7    1    3    5  

                =    =    =   =    =    =    =   =    =  

                1 + 6 + 0 + 8+  3 + 14 +7 +18+20   =   77

 

      2.       4(9번째자리) * 5 / 10 = 2

 

      3.       (77 + 2) / 10 = 9

 

      4.       10 - 9 = 1 

[출처] VB를 이용한 사업자등록번호 진위 여부 Subroutine|작성자 불꽃테란

